Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: We can look at the raw trace output using ``perf script`` with no arguments::
it_it: Possiamo visualizzare l'output di traccia grezzo utilizzando ``perf script`` senza argomenti::

source: We can run that script directly to print all of the events contained in the ``perf.data`` file::
it_it: Possiamo eseguire direttamente questo script per stampare tutti gli eventi contenuti nel file ``perf.data``::

source: We have a frequent issue with contributors whose patches are received through a ``From`` field which doesn't match the ``Signed-off-by`` information. Here is a typical example for people sending from a domain name with :wikipedia:`DMARC`::
it_it: Abbiamo un problema frequente con i collaboratori le cui patch vengono ricevute tramite un campo ``From`` che non corrisponde alle informazioni ``Signed-off-by``. Ecco un esempio tipico per chi invia da un nome di dominio con :wikipedia:`DMARC`::

source: We have set up two security-related emails/mailing lists:
it_it: Abbiamo creato due mailing list/email relative alla sicurezza:

source: We present a :term:`Source Directory` structure and its components in details in the :doc:`/ref-manual/structure` section of the Yocto Project Reference Manual.
it_it: Presentiamo la struttura della :term:`Source Directory` e i suoi componenti in dettaglio nella sezione :doc:`/ref-manual/structure` del Manuale di Riferimento di Yocto Project.

source: We therefore have the following criteria and policies for such items:
it_it: Pertanto, abbiamo i seguenti criteri e politiche per tali elementi:

source: We will have two recipes as an example:
it_it: Prenderemo due ricette come esempio:

source: We'll start by looking at some of the available built-in tracers.
it_it: Iniziamo esaminando alcuni dei tracer integrati disponibili.

source: Web interfaces typically need to perform administrative functions and tend to need to run with elevated privileges. Thus, the consequences resulting from the interface's security becoming compromised can be serious. Look for common web vulnerabilities such as cross-site-scripting (XSS), unvalidated inputs, and so forth.
it_it: Le interfacce web in genere devono svolgere funzioni amministrative e tendono a richiedere privilegi elevati. Pertanto, le conseguenze derivanti da una compromissione della sicurezza dell'interfaccia possono essere gravi. Cerca vulnerabilità web comuni come cross-site scripting (XSS), input non validati e così via.

source: Welcome
it_it: Benvenuti!

source: Welcome to the Yocto Project Documentation
it_it: Benvenuti nella Documentazione di Yocto Project

source: Welcome to the Yocto Project Overview and Concepts Manual! This manual introduces the Yocto Project by providing concepts, software overviews, best-known-methods (BKMs), and any other high-level introductory information suitable for a new Yocto Project user.
it_it: Benvenuti nel Manuale Introduttivo e Concetti di Yocto Project! Questo manuale presenta Yocto Project fornendo concetti, una panoramica del software, le migliori pratiche (BKM) e qualsiasi altra informazione introduttiva di alto livello adatta a un nuovo utente di Yocto Project.

source: Welcome to the Yocto Project Reference Manual. This manual provides reference information for the current release of the Yocto Project, and is most effectively used after you have an understanding of the basics of the Yocto Project. The manual is neither meant to be read as a starting point to the Yocto Project, nor read from start to finish. Rather, use this manual to find variable definitions, class descriptions, and so forth as needed during the course of using the Yocto Project.
it_it: Benvenuti nel Manuale di Riferimento di Yocto Project. Questo manuale fornisce informazioni di riferimento per la versione corrente di Yocto Project ed è più efficace se si hanno familiarità con i concetti di base del progetto. Il manuale non deve essere letto come punto di partenza per Yocto Project, né dall'inizio alla fine. Piuttosto, va utilizzato per trovare definizioni di variabili, descrizioni di classi e così via, a seconda delle necessità durante l'utilizzo di Yocto Project.

source: Welcome to the Yocto Project Security Manual. This manual provides relevant procedures for dealing with security-related tasks supported in the Yocto Project environment. This manual groups related procedures into higher-level sections. Procedures can consist of high-level steps or low-level steps depending on the topic.
it_it: Benvenuti nel Manuale di Sicurezza di Yocto Project. Questo manuale fornisce le procedure pertinenti per la gestione delle attività di sicurezza supportate nell'ambiente di Yocto Project. Il manuale raggruppa le procedure correlate in sezioni di livello superiore. Le procedure possono essere composte da passaggi di alto o basso livello, a seconda dell'argomento.

source: Welcome!
it_it: Benvenuti!

source: What I wish I'd known about Yocto Project
it_it: Cosa sarebbe stato utile sapere sullo Yocto Project

source: What SystemTap does under the covers to run this probe is 1) parse and convert the probe to an equivalent "C" form, 2) compile the "C" form into a kernel module, 3) insert the module into the kernel, which arms it, and 4) collect the data generated by the probe and display it to the user.
it_it: Ciò che SystemTap fa internamente per eseguire questo probe [sonda] è: 1) analizzare e convertire la sonda in un form equivalente in linguaggio "C", 2) compilare il form "C" in un modulo del kernel, 3) inserire il modulo nel kernel, attivandolo, e 4) raccogliere i dati generati dalla sonda e visualizzarli all'utente.

source: What is the Yocto Project?
it_it: Cos'è Yocto Project?

source: What pieces of the system have changed and what pieces have not changed?
it_it: Quali parti del sistema sono cambiate e quali no?

source: What you should do if you find a security vulnerability
it_it: Cosa fare in caso di vulnerabilità di sicurezza

source: When :term:`PV` increases, any existing :term:`PR` value can and should be removed.
it_it: Quando :term:`PV` aumenta, qualsiasi valore :term:`PR` esistente può e deve essere rimosso.

source: When BitBake parses the metadata (recipes and configuration files), it caches the results in ``build/tmp/cache/`` to speed up future builds. The results are stored on a per-machine basis.
it_it: Quando BitBake analizza i metadati (ricette e file di configurazione), memorizza nella cache i risultati in ``build/tmp/cache/`` per velocizzare le compilazioni future. I risultati vengono memorizzati per ogni singola macchina.

source: When Hash Equivalence is enabled, BitBake computes the task hash for each task by using the unihash of its dependencies, instead of their task hash.
it_it: Quando l'Hash Equivalence è abilitata, BitBake calcola l'hash di ciascun task utilizzando l'unihash delle sue dipendenze, anziché il loro hash.

source: When Toaster is set up as a local instance, all the components reside on a single build host. Fundamentally, a local instance of Toaster is suited for a single user developing on a single build host.
it_it: Quando Toaster è configurato come istanza locale, tutti i componenti risiedono su un singolo host di build. Fondamentalmente, un'istanza locale di Toaster è adatta a un singolo utente che sviluppa su un singolo host di build.

source: When a recipe references a git revision that does not correspond to a released version of software (e.g. is not a tagged version), the :term:`PV` variable should include the sign ``+``, so :term:`bitbake` automatically includes package version information during the packaging phase::
it_it: Quando una ricetta fa riferimento a una revisione Git che non corrisponde a una versione rilasciata del software (ad esempio, non è una versione con tag), la variabile :term:`PV` deve includere il segno ``+``, in modo che :term:`bitbake` includa automaticamente le informazioni sulla versione del pacchetto durante la fase di creazione del pacchetto.

source: When a variable is defined in recipes and classes, variables should follow the general order when possible:
it_it: Quando una variabile viene definita in ricette e classi, le variabili dovrebbero seguire, ove possibile, il seguente ordine generale:

source: When adding extra user accounts or setting a root password, be cautious about setting the same password on every device. If you do this, and the password you have set is exposed, then every device is now potentially compromised. If you need this access but want to ensure security, consider setting a different, random password for each device. Typically, you do this as a separate step after you deploy the image onto the device.
it_it: Quando si aggiungono ulteriori account utente o si imposta una password di root, prestare attenzione a non utilizzare la stessa password su tutti i dispositivi. In tal caso, se la password impostata viene esposta, tutti i dispositivi potrebbero essere compromessi. Se è necessario questo accesso ma si desidera garantire la sicurezza, è consigliabile impostare una password diversa e casuale per ogni dispositivo. In genere, questa operazione viene eseguita separatamente dopo aver distribuito l'immagine sul dispositivo.

source: When analyzing CVEs, it is recommended to:
it_it: Quando si analizzano le CVE, si raccomanda di:

source: When creating ``Makefile`` files, it is strongly recommended to use ``CC``, ``LDFLAGS`` and ``CFLAGS`` as BitBake will set them as environment variables according to your build configuration.
it_it: Quando si creano file ``Makefile``, i raccomanda vivamente di utilizzare ``CC``, ``LDFLAGS`` e ``CFLAGS`` poiché BitBake li imposterà come variabili d'ambiente in base alla configurazione di compilazione.

source: When creating shared libraries, it is strongly recommended to follow the Linux conventions and guidelines (see `this article <https://tldp.org/HOWTO/Program-Library-HOWTO/shared-libraries.html>`__ for some background).
it_it: Quando si creano librerie shared, si raccomanda vivamente di seguire le convenzioni e le linee guida di Linux (vedere `questo articolo <https://tldp.org/HOWTO/Program-Library-HOWTO/shared-libraries.html>`__ per maggiori informazioni).

source: When cross-compiling, the target file system may be differently laid out and contain different things compared to the host system. The concept of a *sysroot* is directory which looks like the target filesystem and can be used to cross-compile against.
it_it: Durante la cross-compilazione, il file system target può avere una struttura e un contenuto diversi rispetto al sistema host. Il concetto di *sysroot* si riferisce a una directory che riproduce il file system target e può essere utilizzata per la cross-compilazione.

source: When declared, a built-in fragment follows the following naming convention::
it_it: Quando viene dichiarato, un "built-in fragment" segue la seguente convenzione di nomenclatura::

source: When determining what parts of the system need to be built, BitBake works on a per-task basis rather than a per-recipe basis. You might wonder why using a per-task basis is preferred over a per-recipe basis. To help explain, consider having the IPK packaging backend enabled and then switching to DEB. In this case, the :ref:`ref-tasks-install` and :ref:`ref-tasks-package` task outputs are still valid. However, with a per-recipe approach, the build would not include the ``.deb`` files. Consequently, you would have to invalidate the whole build and rerun it. Rerunning everything is not the best solution. Also, in this case, the core must be "taught" much about specific tasks. This methodology does not scale well and does not allow users to easily add new tasks in layers or as external recipes without touching the packaged-staging core.
it_it: Quando si determina quali parti del sistema devono essere compilate, BitBake lavora per singolo task anziché per singola ricetta. Ci si potrebbe chiedere perché si preferisca un approccio per singolo task a uno per singola ricetta. Per chiarire, si consideri l'ipotesi di avere il backend di packaging IPK abilitato e poi passare a DEB. In questo caso, gli output dei task :ref:`ref-tasks-install` e :ref:`ref-tasks-package` rimangono validi. Tuttavia, con un approccio per singola ricetta, la build non includerebbe i file ``.deb``. Di conseguenza, sarebbe necessario invalidare l'intera build e rieseguirla. Rieseguire tutto non è la soluzione migliore. Inoltre, in questo caso, il core deve essere "istruito" su molti task specifici. Questa metodologia non è scalabile e non consente agli utenti di aggiungere facilmente nuovi task in layer o come ricette esterne senza modificare il "core packaged-staging".

source: When fetching a repository, BitBake uses the :term:`SRCREV` variable to determine the specific revision from which to build.
it_it: Quando recupera un repository, BitBake utilizza la variabile :term:`SRCREV` per determinare la revisione specifica da cui effettuare la compilazione.

source: When inheriting the :ref:`ref-classes-features_check` class, this variable identifies a list of distribution features where at least one must be enabled in the current configuration in order for the OpenEmbedded build system to build the recipe. In other words, if none of the features listed in :term:`ANY_OF_DISTRO_FEATURES` appear in :term:`DISTRO_FEATURES` within the current configuration, then the recipe will be skipped, and if the build system attempts to build the recipe then an error will be triggered.
it_it: Quando si eredita la classe :ref:`ref-classes-features_check`, questa variabile identifica un elenco di funzionalità di distribuzione di cui almeno una deve essere abilitata nella configurazione corrente affinché il sistema di build OpenEmbedded possa compilare la ricetta. In altre parole, se nessuna delle funzionalità elencate in :term:`ANY_OF_DISTRO_FEATURES` è presente in :term:`DISTRO_FEATURES` nella configurazione corrente, la ricetta verrà saltata e, se il sistema di compilazione tenta di compilarla, verrà generato un errore.

source: When it's done, do a ``Ctrl-C`` on the target system to stop the trace::
it_it: Al termine, si preme ``Ctrl-C`` sul sistema target per interrompere la traccia::

source: When preparing the patch file, take the original patch from the upstream repository. Do not use patches from different distributions, except if it is the only available source.
it_it: Quando si prepara il file di patch, utilizzare la patch originale dal repository upstream. Non utilizzare patch provenienti da distribuzioni diverse, a meno che non siano l'unica fonte disponibile.

source: When securing your image is of concern, there are steps, tools, and variables that you can consider to help you reach the security goals you need for your particular device. Not all situations are identical when it comes to making an image secure. Consequently, this section provides some guidance and suggestions for consideration when you want to make your image more secure.
it_it: Quando la sicurezza di un'immagine è una priorità, esistono passaggi, strumenti e variabili da considerare per raggiungere gli obiettivi di sicurezza necessari per il proprio dispositivo. Non tutte le situazioni sono identiche quando si tratta di proteggere un'immagine. Pertanto, questa sezione fornisce alcune indicazioni e suggerimenti da tenere in considerazione quando si desidera rendere la propria immagine più sicura.

source: When setting up the build manually (see :doc:`/dev-manual/poky-manual-setup`), you have a lot of flexibility when creating the :term:`Build Directory`. Here are some examples that show how to create the directory. The examples assume your :term:`Source Directory` is named ``bitbake-builds``:
it_it: Quando si configura la build manualmente (vedere :doc:`/dev-manual/poky-manual-setup`), si ha molta flessibilità nella creazione della :term:`Build Directory`. Ecco alcuni esempi che mostrano come creare la directory. Gli esempi presuppongono che la :term:`Source Directory` si chiami ``bitbake-builds``:

source: When significant issues are found, :term:`LTS` releases allow to publish fixes not only for the current stable release, but also to the :term:`LTS` releases that are still supported. Older stable releases which have reached their End of Life (EOL) won't receive such updates.
it_it: Quando vengono rilevati problemi significativi, le versioni :term:`LTS` consentono di pubblicare correzioni non solo per la versione stabile corrente, ma anche per le versioni :term:`LTS` ancora supportate. Le versioni stabili più vecchie che hanno raggiunto la fine del loro ciclo di vita [End of Life] (EOL) non riceveranno tali aggiornamenti.

source: When splitting a long variable over multiple lines, all continuation lines should be indented (with spaces) to align with the start of the quote on the first line::
it_it: Quando si suddivide una variabile lunga su più righe, tutte le righe di continuazione devono essere rientrate (con spazi) per allinearsi all'inizio della virgoletta sulla prima riga::

source: When the OpenEmbedded build system generates an image or an SDK, it gets the packages from a package feed area located in the :term:`Build Directory`. The :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>` shows this package feeds area in the upper-right corner.
it_it: Quando il sistema di build OpenEmbedded genera un'immagine o un SDK, preleva i pacchetti da un'area di feed [alimentazione] di pacchetti situata nella :term:`Build Directory`. La :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>` mostra quest'area di feed di pacchetti nell'angolo in alto a destra.

source: When the YP Security team receives a report about a potential security vulnerability, they quickly analyze and notify the reporter of the result. They might also request more information.
it_it: Quando l'YP Security team riceve una segnalazione su una potenziale vulnerabilità di sicurezza, la analizza rapidamente e comunica il risultato al segnalatore. Potrebbe anche richiedere ulteriori informazioni.

source: When the fix is publicly available, the YP security team member or the package maintainer sends patches against the YP code base, following usual procedures, including public code review.
it_it: Quando la correzione è disponibile pubblicamente, il membro del team di sicurezza di YP o il manutentore del pacchetto invia le patch al codice sorgente di YP, seguendo le procedure standard, inclusa la revisione pubblica del codice.

source: When the preferred provider is assumed by default, the :term:`PREFERRED_PROVIDER` statement does not appear in the ``"bsp_root_name".conf`` file.
it_it: Quando il provider preferito è quello di default, l'istruzione :term:`PREFERRED_PROVIDER` non compare nel file ``"bsp_root_name".conf``.

source: When the upstream project releases a version with the fix, they are responsible for contacting an appropriate CVE Numbering Authority (CNA), such as `Mitre <https://cveform.mitre.org/>`__, to get a CVE number assigned and the CVE record published.
it_it: Quando il progetto upstream rilascia una versione con la correzione, è sua responsabilità contattare una CVE Numbering Authority (CNA) appropriata, come `Mitre <https://cveform.mitre.org/>`__, per ottenere l'assegnazione di un numero CVE e la pubblicazione del record CVE.

source: When updating a kernel recipe, a helper script needs to be run manually to update the :term:`CVE_STATUS` for the kernel recipe. The script can be used for custom kernels.
it_it: Quando si aggiorna una ricetta del kernel, è necessario eseguire manualmente uno script di supporto per aggiornare il :term:`CVE_STATUS` per la ricetta del kernel. Lo script può essere utilizzato per i kernel personalizzati.

source: When using :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`, this script is indirectly sourced when sourcing the ``init-build-env`` located in the :term:`bitbake:Setup`'s build directory. However, compared to ``oe-init-build-env``, the bitbake-setup ``init-build-env`` does not take any argument, as it is already located in a :term:`Build Directory`.
it_it: Quando si utilizza :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`, questo script viene eseguito indirettamente quando si esegue ``init-build-env`` he si trova nella directory di build di :term:`bitbake:Setup`. Tuttavia, rispetto a ``oe-init-build-env``, ``init-build-env`` di bitbake-setup non accetta argomenti, poiché si trova già in una :term:`Build Directory`.

source: When using ``manage.py`` commands given a default configuration, you must be sure that your working directory is set to the :term:`Build Directory`. Using ``manage.py`` commands from the :term:`Build Directory` allows Toaster to find the ``toaster.sqlite`` file, which is located in the :term:`Build Directory`.
it_it: Quando si utilizzano i comandi ``manage.py`` con una configurazione di default, è necessario assicurarsi che la directory di lavoro sia impostata sulla :term:`Build Directory`. Utilizzando i comandi ``manage.py`` dalla :term:`Build Directory`, Toaster può trovare il file ``toaster.sqlite``, che si trova nella :term:`Build Directory`.

source: When you :ref:`initialize the build environment <dev-manual/start:Initializing the Build Environment>`, you can specify which directory will be the :term:`Source Directory`.
it_it: Quando si :ref:`inizializza l'ambiente di build <dev-manual/start:Initializing the Build Environment>`, è possibile specificare quale directory sarà la :term:`Source Directory`.

source: When you build an image using the Yocto Project, the build process uses a known list of licenses to ensure compliance. You can find this list in :term:`OpenEmbedded-Core (OE-Core)` at :oe_git:`meta/files/common-licenses </openembedded-core/tree/meta/files/common-licenses>`. Once the build completes, the list of all licenses found and used during that build are kept in the :term:`Build Directory` at ``tmp/deploy/licenses``.
it_it: Quando si crea un'immagine utilizzando Yocto Project, il processo di compilazione utilizza un elenco noto di licenze per garantire la conformità. È possibile trovare questo elenco in :term:`OpenEmbedded-Core (OE-Core)` in :oe_git:`meta/files/common-licenses </openembedded-core/tree/meta/files/common-licenses>`. Una volta completata la compilazione, l'elenco di tutte le licenze trovate e utilizzate durante tale compilazione viene conservato nella :term:`Build Directory` in ``tmp/deploy/licenses``.

source: When you change the :term:`LICENSE` or :term:`LIC_FILES_CHKSUM` in the recipe due to upstream making modifications to the license files, you need to briefly explain the reason for the change via a ``License-Update:`` tag. Often it's quite trivial, such as::
it_it: Quando si modificano i campi :term:`LICENSE` o :term:`LIC_FILES_CHKSUM` nella ricetta a seguito di modifiche apportate dal progetto originale ai file di licenza, è necessario spiegare brevemente il motivo della modifica tramite un tag ``License-Update:``. Spesso si tratta di una spiegazione piuttosto semplice, ad esempio::
